03_Ruby/Rails/solar_system/app/controllers/planets_controller.rb

  def index
    @planets = Planet.all
---
SELECT "planets".* FROM "planets"

  def show
    @planet = Planet.find params[:id]
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]

  def create
    planet = Planet.new
    planet.name = params[:name]
    planet.image = params[:image]
    planet.orbit = params[:orbit]
    planet.diameter = params[:diameter]
    planet.mass = params[:mass]
    planet.moons = params[:moons]
    planet.save
---
INSERT INTO "planets" ("name", "image", "orbit", "diameter", "mass", "moons") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Mars"], ["image", ""], ["orbit", 7.0], ["diameter", 87.0], ["mass", 789.0], ["moons", 789]]

  def edit
    @planet = Planet.find params[:id]
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def update
    planet = Planet.find params[:id]
    planet.name = params[:name]
    planet.image = params[:image]
    planet.orbit = params[:orbit]
    planet.diameter = params[:diameter]
    planet.mass = params[:mass]
    planet.moons = params[:moons]
    planet.save
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "planets" SET "image" = ?, "moons" = ? WHERE "planets"."id" = ?  [["image", ""], ["moons", 4], ["id", 10]]

  def destroy
    planet = Planet.find params[:id]
    planet.destroy # LOL Alderaan
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "planets" WHERE "planets"."id" = ?  [["id", 14]]