03_Ruby/Rails/moma/app/controllers/artists_controller.rb

  def show
    @artist = Artist.find params[:id]
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def create
    artist = Artist.create artist_params
---
INSERT INTO "artists" ("name", "nationality", "period", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Ken Done"], ["nationality", "Australian"], ["period", ""], ["image", ""], ["created_at", "2019-04-16 05:19:08.107487"], ["updated_at", "2019-04-16 05:19:08.107487"]]

  def edit
    @artist = Artist.find params[:id]
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    artist = Artist.find params[:id]
    artist.destroy
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 8]]