03_Ruby/Rails/moma/app/controllers/works_controller.rb

  def index
    @works = Work.all
---
SELECT "works".* FROM "works"

  def show
    @work = Work.find params[:id]
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    work = Work.create work_params
---
INSERT INTO "works" ("title", "year", "medium", "style", "image", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @work = Work.find params[:id]
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def update
    work = Work.find params[:id]
    work.update work_params
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "works" SET "year" = ?, "medium" = ?, "style" = ?, "updated_at" = ? WHERE "works"."id" = ?  [["year", "1998"], ["medium", "Oil on Canvas"], ["style", "Great!"], ["updated_at", "2019-04-17 02:44:20.508629"], ["id", 8]]