03_Ruby/Rails/moma/app/views/artists/show.html.erb

SELECT "works".* FROM "works" WHERE "works"."artist_id" = ?  [["artist_id", 9]]
---

<% @artist.works.each do |work| %>