03_Ruby/Rails/tunr/app/controllers/session_controller.rb

  def create
    user = User.find_by :email => params[:email]
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jimmy@aspinall.com"], ["LIMIT", 1]]