03_Ruby/Rails/tunr/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @user = User.new user_params
    if @user.save