03_Ruby/Rails/movie_night/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "streaming", "releasde", "rating", "plot", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save